In [ ]:
import pandas as pd

In [ ]:
# lendo uma base de dados  no formato .csv
#sep = separador entre os dados.
#header = qual linha esÂ´ta minhas colunas 
arquivo ='/content/kc_house_data.csv'
dataset = pd.read_csv(arquivo,sep=',',header=0)

In [ ]:
type(dataset)

pandas.core.frame.DataFrame

In [ ]:
dataset.head(10)

                         id      price  ...  sqft_living15  sqft_lot15
date                                    ...
20141013T000000  7129300520   221900.0  ...           1340        5650
20141209T000000  6414100192   538000.0  ...           1690        7639
20150225T000000  5631500400   180000.0  ...           2720        8062
20141209T000000  2487200875   604000.0  ...           1360        5000
20150218T000000  1954400510   510000.0  ...           1800        7503
20140512T000000  7237550310  1225000.0  ...           4760      101930
20140627T000000  1321400060   257500.0  ...           2238        6819
20150115T000000  2008000270   291850.0  ...           1650        9711
20150415T000000  2414600126   229500.0  ...           1780        8113
20150312T000000  3793500160   323000.0  ...           2390        7570

[10 rows x 20 columns]

In [ ]:
dataset = pd.read_csv(arquivo,sep=',',index_col='date')

dataset = pd.read_csv(arquivo,sep=',', usecols=('id','date','price','bedrooms')

In [ ]:
dataset.head()

           id             date     price  bedrooms
0  7129300520  20141013T000000  221900.0         3
1  6414100192  20141209T000000  538000.0         3
2  5631500400  20150225T000000  180000.0         2
3  2487200875  20141209T000000  604000.0         4
4  1954400510  20150218T000000  510000.0         3

In [ ]:
dataset.columns

Index(['id', 'date', 'price', 'bedrooms'], dtype='object')

In [ ]:
dataset.count()

id          21613
date        21613
price       21613
bedrooms    21613
dtype: int64

In [ ]:
dataset.describe()

                 id         price      bedrooms
count  2.161300e+04  2.161300e+04  21613.000000
mean   4.580302e+09  5.400881e+05      3.370842
std    2.876566e+09  3.671272e+05      0.930062
min    1.000102e+06  7.500000e+04      0.000000
25%    2.123049e+09  3.219500e+05      3.000000
50%    3.904930e+09  4.500000e+05      3.000000
75%    7.308900e+09  6.450000e+05      4.000000
max    9.900000e+09  7.700000e+06     33.000000

In [ ]:
dataset.tail()

               id             date     price  bedrooms
21608   263000018  20140521T000000  360000.0         3
21609  6600060120  20150223T000000  400000.0         4
21610  1523300141  20140623T000000  402101.0         2
21611   291310100  20150116T000000  400000.0         3
21612  1523300157  20141015T000000  325000.0         2

In [ ]:
dataset.shape

(21613, 4)

In [ ]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21613 entries, 0 to 21612
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   id        21613 non-null  int64
 1   date      21613 non-null  object
 2   price     21613 non-null  float64
 3   bedrooms  21613 non-null  int64
dtypes: float64(1), int64(2), object(1)
memory usage: 675.5+ KB